package com.fenxi.kuozhi.bean;

import java.io.Serializable;
import java.util.List;

public class FenxiKuoBean implements Serializable {


    /**
     * errcode : 0
     * learn_cardlist : [{"content":["34.(1)从感性认识与理性认识的辩证统一关系角度，说明如何处理好\u201c调查\u201d和\u201c研究\u201c两个环节的关系。","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(1)\u201c调查\u201d是指获取感性认识。\u201c研究\u201d是指在实践基础上认识活动由感性认识能动地飞跃到理性认识。感性认识是人们在实践基础上，由感觉器官直接感受到的关于事物的现象、事物的外部联系、事物的各个方面的认识。理性认识是指人们借助抽象思维，在概括整理大量感性材料的基础上，达到关于事物的本质、全体、内部联系和事物自身规律性的认识。<br>感性认识和理性认识的关系是辩证统一的。第一，理性认识依赖于感性认识。感性认识是认识过程的起点，是达到理性认识的必经阶段，没有感性认识，就没有理性认识。第二，感性认识有待于发展和深化为理性认识。感性认识是认识的初级阶段，是对事物外部联系的认识，还不能达到对事物的本质和规律的认识，因而还不是完全的认识。<br>从感性认识上升到理性认识，必须具备两个基本条件：第一，投身实践，深入调查，获取十分丰富和合乎实际的感性材料。这是实现由感性认识上升到理性认识的基础。第二，经过思考的作用，运用理论思维和科学抽象，将丰富的感性材料加以去粗取精、去伪存真、由此及彼、由表及里的处理加工，形成概念和理论的系统。<br>要想获得解决问题的正确认识，\u201c调查\u201d和\u201c研究\u201d缺一不可。如果割裂了二者的辩证统一关系，就会犯教条主义或经验主义的错误。<\/span>"],"field_name":["题干","答案"],"cardid":76001,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["34.(2)为什么必须\u201c坚持问题导向\u201d，\u201c以解决问题为根本目的\"？","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(2)坚持问题导向，是习近平新时代中国特色社会主义思想的重要方法，是辩证唯物主义矛盾观点和矛盾分析方法的时代表达和时代升华。马克思主义认为，矛盾是普遍存在的。问题是事物矛盾的表现形式，发现了问题就等于抓住了事物的矛盾。坚持问题导向，在世界观和方法论上就是要承认矛盾的普遍性、客观性；在工作和实践中就是要把解决实际问题作为打开工作局面的突破口。<br>坚持问题导向，不仅要增强问题意识，还要善于发现问题、敢于正视问题；不仅要科学分析问题、深入研究问题，还要勇于触及矛盾、长于化解矛盾，尤其是要善于灵活运用辩证思维、创新思维等科学思维方法解决各种复杂问题。<\/span>"],"field_name":["题干","答案"],"cardid":76002,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["34.(3)运用唯物史观原理，说明调查研究为什么要坚持党的群众路线","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(3)人民群众是社会历史的主体，是历史的创造者。人民群众的总体意愿和行动代表了历史发展的方向，人民群众的社会实践最终决定历史发展的结局。人民群众是社会物质财富创<br>造者，是社会精神财富的创造者，是社会变革的决定力量。唯物史观关于人民群众是历史创造者的原理，要求我们坚持马克思主义群众观点，贯彻党的群众路线。群众路线的实质，就在于充分相信群众，坚决依靠群众，密切联系群众，全心全意为人民群众服务。调查研究必须坚持群众路线，自觉向群众学习、向实践学习，从人民的创造性实践中获得正确认识。<\/span>"],"field_name":["题干","答案"],"cardid":76003,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["35.(1)如何理解\u201c两个结合\u201d是\u201c我们取得成功的最大法宝\u201d？（或：如何理解\u201c两个结合\u201d是开辟和发展中国特色社会主义的必由之路？)","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(1)我们党始终高度重视把马克思主义基本原理同中国具体实际相结合。毛泽东第一次系统阐述马克思主义基本原理同中国具体实际相结合的一系列重大问题，并提出要使马克思主义具有民族形式。习近平总结党百年来的理论创新经验，在强调坚持\u201c第一个结合\u201d的基础上，明确提出把马克思主义基本原理同中华优秀传统文化相结合的重大命题，这是又一次的思想解放。<br>第一，习近平新时代中国特色社会主义思想坚持把马克思主义基本原理同中国具体实际相结合，用马克思主义之\u201c矢\u201d去射新时代中国之\u201c的\u201d。马克思主义理论不是教条，而是行动指南。马克思主义能不能在实践中发挥作用，关键在于能否把马克思主义基本原理同中国实际和时代特征结合起来，关键在于能否运用其科学的世界观和方法论解决中国的问题。<br>第二，习近平新时代中国特色社会主义思想坚持把马克思主义基本原理同中华优秀传统文化相结合，不断夯实马克思主义中国化时代化的历史基础和群众基础。只有植根本国、本民族历史文化沃土，马克思主义真理之树才能根深叶茂。中华优秀传统文化源远流长、博大精深，是中华文明的智慧结晶，同马克思主义具有高度契合性。我们必须把马克思主义思想精髓同中华优秀传统文化精华贯通起来、同人民群众日用而不觉的共同价值观念融通起来，不断赋予科学理论鲜明的中国特色，让马克思主义更深地扎根于中国的土地上、扎根于亿万人民的心中。<br>\u201c两个结合\u201d是对坚持和发展马克思主义作出的重大理论贡献。我们党百年来取得的全部成就，都是坚持\u201c两个结合\u201d的结果。只有坚持\u201c两个结合\u201d，才能正确回答时代和实践提出的重大问题，才能始终保持马克思主义的蓬勃生机和旺盛活力，不断开辟马克思主义中国化时代化新境界。<\/span>"],"field_name":["题干","答案"],"cardid":76004,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["35.(2)为什么说\u201c第二个结合\u201d是又一次思想解放？","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(2)\u201c第二个结合\u201c回答了马克思主义基本原理为什么能够而且必须同中华优秀传统文化结合的问题，回答了马克思主义基本原理如何同中华优秀传统文化相结合以及结合的结果问题表明我们党对中国道路、理论、制度的认识达到了新度，表明我们党的历史自信、文化自信达了新高度，表明我们党在传承中华优秀传统文化中推进文化创新的自觉性达到了新高度。<br>第一,\u201c结合\u201d的前提是彼此契合。马克思主义和中华优秀传统文化来源不同,但彼此存高度的契合性。相互契合才能有机结合。<br>第二，\u201c结合\u201d的结果是互相成就，造就了一个有机统一的新的文化生命体，让马克思主义为中国的，中华优秀传统文化成为现代的，让经由\u201c结合\u201d而形成的新文化成为中国式现代化的文化形态。<br>第三，\u201c结合\u201d筑牢了道路根基，让中国特色社会主义道路有了更加宏阔深远的历史纵深，拓展了中国特色社会主义道路的文化根基。中国式现代化赋予中华文明以现代力量，中华文明赋予中国式现代化以深厚底蕴。<br>第四，\u201c结合\u201d打开了创新空间，让我们掌握了思想和文化主动，并有力地作用于道路、理论和制度；让我们能够在更广阔的文化空间中，充分运用中华优秀传统文化的宝贵资源，探索面向未来的理论和制度创新。<br>第五，\u201c结合\u201d巩固了文化主体性，创立习近平新时代中国特色社会主义思想就是这一文化主体性的最有力体现。<\/span>"],"field_name":["题干","答案"],"cardid":76005,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["36.(1)探索中国现代化道路的重任，历史地落在了中国共产党身上。如何理解\u201c中国式现代化是我们党领导全国各族人民在长期探索和实践中历经千辛万苦、付出巨大代价取得的重大成果\u201d？","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(1)具有5000多年文明历史的中华民族，长期走在世界前列。1840年的鸦片战争使中国逐步沦为半殖民地半封建社会。为了摆脱落后挨打、任人宰割的悲惨命运，中国人民奋起反抗，仁人志士苦苦求索，进行民族复兴的各种尝试，洋务运动试图\u201c师夷长技以制夷\u201d，戊戌变法试图通过改良来图强，孙中山先生领导辛亥革命试图以资产阶级共和国、振兴实业等方案来实现现代化，但都以失败告终。探索中国现代化道路的重任，历史地落在了中国共产党身上。<br>第一，新民主主义革命时期，我们党团结带领人民进行革命斗争，取得了新民主主义革命的胜利，为实现现代化创造了根本社会条件。<br>第二，社会主义革命和建设时期，我们党带领人民完成了社会主义革命，推进了社会主义建设，为现代化建设奠定了根本政治前提和制度基础，提供了宝贵经验、理论准备、物质基础。<br>第三，改革开放和社会主义现代化建设新时期，我们党作出把党和国家工作中心转移到经济建设上来、实行改革开放的历史性决策，开启了中国式现代化的新长征，为中国式现代化提供了充满新的活力的体制保证和快速发展的物质条件：<br>第四，进入新时代，我们党围绕解决现代化建设中存在的突出矛盾和问题，不断实现理论和实践上的创新突破，成功推进和拓展了中国式现代化。<\/span>"],"field_name":["题干","答案"],"cardid":76006,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["36.(2)如何理解中国式现代化\u201c是我们强国建设、民族复兴的康庄大道，也是中国谋求人类进步、世界大同的必由之路\u201d？（或：如何理解中国式现代化是我们为如何唤醒\u201c睡狮\u201d、实现民族复兴这个重大历史课题所给出的答案？)","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(2)中国式现代化既基于自身国情、又借鉴各国经验，既传承历史文化、又融合现代文明，是具有中国特色、符合中国实际的现代化。新中国成立特别是改革开放以来，我们用几十年时间走完西方发达国家几百年走过的工业化历程，创造了经济快速发展和社会长期稳定的奇迹，为中华民族伟大复兴开辟了广阔前景。实践证明，中国式现代化是强国建设、民族复兴的唯一正确道路。<br>中国式现代化，深深植根于中华优秀传统文化，体现科学社会主义的先进本质，借鉴吸收一切人类优秀文明成果，是一种全新的人类文明形态。<br>中国式现代化，打破了\u201c现代化=西方化\u201d的迷思，展现了现代化的另一幅图景，拓展了发展<br>中国家走向现代化的路径选择，为人类对更好社会制度的探索提供了中国方案。中国式现代化蕴含的独特世界观、价值观、历史观、文明观、民主观、生态观等及其伟大实践，是对世界现代化理论和实践的重大创新。中国式现代化为广大发展中国家独立自主迈向现代化树立了典范，为其提供了全新选择。<\/span>"],"field_name":["题干","答案"],"cardid":76007,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["37.(1)新征程上，广大青年为什么要\u201c立志高远、脚踏实地\u201d？","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(1)志向，就是理想信念；立志，就是确立理想信念。理想信念是精神之\u201c钙\u201d，是人生发展的内在动力。第一，理想信念昭示奋斗目标。第二，理想信念催生前进动力。第三，理想信念提供精神支柱。第四，理想信念提高精神境界。只有树立起崇高的理想信念，才能够解答好人生的意义、奋斗的价值以及做什么样的人等重要的人生课题。志向高远，便力量无穷。一个人有了崇高坚定的理想信念，才会以惊人的毅力和不懈的努力成就事业。<br>理想信念是一个思想认识问题，更是一个实践问题。理想的实现往往要通过一条并不平坦的曲折之路，有赖于脚踏实地、持之以恒的奋斗。广大青年肩负实现中华民族伟大复兴的中国梦的历史重任，只有把实现理想的道路建立在脚踏实地的奋斗上，才能放飞青春梦想，实现人生理想。<\/span>"],"field_name":["题干","答案"],"cardid":76008,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["37.(2)为什么说\u201c坚定理想信念不是一阵子而是一辈子的事，要常修常炼、常悟常进，无论顺境境都坚贞不渝\u201d？","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(2)理想的实现是一个过程。理想越是远大，它的实现过程就越复杂，需要的时间也就越漫长。任何一种理想的实现都不是轻而易举的，必然会遇到各种各样的困难和波折，充满艰险和坎坷。实现理想、创造未来，必须有战胜种种艰难险阻的坚定不移的信心和坚忍不拔的毅力。<br>理想变为现实不是一帆风顺的，往往会遭遇波澜和坎坷，既有顺境，也有逆境。顺境和逆境是人生历程中两种不同的境遇。在人生旅途中没有永远的顺境，也没有永远的逆境。无论是顺境还是逆境，对人生的作用都可能是双面的，关键是怎样去认识和对待它们。要正确对待个人成长的外部环境，处优而不养尊，受挫而不短志，使顺境逆境都成为人生的财富而不是人生的包袱。只有善于利用顺境，勇于正视逆境、战胜逆境，人生价值才能够实现。<\/span>"],"field_name":["题干","答案"],"cardid":76009,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["37.(3)新时代中国青年应该有怎样的精气神？（或：如何理解\u201c选择吃苦也就选择了收获，选择奉献也就选择了高尚\"？)","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(3)青年人要树立艰苦奋斗的精神。艰苦奋斗是实现理想的重要条件。人类的美好理想，都不可能唾手可得。在通向理想的道路上，在实现理想的过程中，没有艰苦奋斗的精神，理想是不会自动转化为现实的。艰苦奋斗是成就人生事业不可或缺的条件。艰苦奋斗是我们的传家宝，艰苦奋斗的精神永远不会过时。当代中国既面临着重要发展机遇，也面临着前所未有的困难和挑战。实现我们的发展目标，需要广大青年锲而不舍、驰而不息的奋斗，不断书写奉献青春的时代篇章。<br>青年时代，选择吃苦也就选择了收获，选择奉献也就选择了高尚。真正的快乐往往由奋斗的艰苦转化而来。人世间的一切幸福都需要靠辛勤的劳动来创造。追求幸福的过程就是不满足于现状、不断追求和创造更美好生活的过程。我们要享受眼前的幸福，更要不断奋斗，创造未来的幸福，在奋斗中创造幸福人生。<br>青年人要树立崇高的职业理想，服从社会发展的需要，把自己对职业的期望与社会的需要、现实的可能结合起来，从实际出发选择职业和工作岗位，把艰苦环境、艰巨任务作为磨炼自己的机遇，把肯吃苦、敢吃苦当作成就更好人生的选择，主动到条件艰苦的基层、国家建设的一线、项目攻关的前沿，成就一番事业。<br>青年人要牢固树立幸福生活是靠劳动创造的观念，热爱劳动、勤勉工作，无论从事什么劳动都要干一行、爱一行、钻一行，脚踏实地，在实践中一步步成长起来。<\/span>"],"field_name":["题干","答案"],"cardid":76010,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["38.(1)如何理解共建\u201c一带一路\u201d\u201c汇集着人类共同发展的最大公约数\u201d，\u201c走的是人间正道\u201d？","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(1)共建\u201c一带一路\u201d追求的是发展，崇尚的是共赢，传递的是希望。共建\u201c一带一路\u201d，是经济合作倡议，不是搞地缘政治联盟或军事同盟，不针对谁也不排除谁；是开放包容进程不是要关起门来搞\u201c小圈子\u201d或者\u201c中国俱乐部\u201d；是中国同世界共享机遇、共谋发展的阳光大道，不是这样那样的所谓\u201c陷阱\u201d，不以意识形态划界，不搞零和游戏。共建\u201c一带一路\u201d坚持共商共建共享，跨越不同文明、文化、社会制度、发展阶段差异，开辟了各国交往的新路径，搭建起国际合作的新框架，汇集着人类共同发展的\u201c最大公约数\u201d。<br>\u201c一带一路\u201d国际合作充分证明，人类是相互依存的命运共同体；只有合作共赢才能办成事、办好事、办大事；和平合作、开放包容、互学互鉴、互利共赢的丝路精神，是共建\u201c一带一路\u201d最重要的力量源泉。10年来，共建\u201c一带一路\u201d取得历史性成就，开拓出一条通向共同发展的合作之<br>路、机遇之路、繁荣之路，成为深受欢迎的国际公共产品和国际合作平台。这一历程证明，共建\u201c一带一路\u201d站在了历史正确一边，符合时代进步的逻辑，走的是人间正道。<\/span>"],"field_name":["题干","答案"],"cardid":76011,"card_type":1,"dayid":null,"studytimestamp":1702013009},{"content":["38.(2)为什么说\u201c共建\u2018一带一路'源自中国，成果和机遇属于世界\u201d？（或：如何理解共建\u201c一带一路\u201d为世界和平与发展注入正能量？)","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(2)当今世界正处于百年未有之大变局，人类文明发展面临越来越多的问题和挑战。中国着眼人类前途命运和整体利益，因应全球发展及各国期待，继承和弘扬丝路精神这一人类文明的宝贵遗产，提出共建\u201c一带一路\u201d倡议。这一倡议，连接着历史、现实与未来，源自中国、面向世界、惠及全人类。<br>共建\u201c一带一路\u201d以构建人类命运共同体为最高目标，并为实现这一目标搭建了实践平台提供了实现路径，推动美好愿景不断落实落地，是完善全球治理的重要公共产品。共建\u201c一带一路\u201d跨越不同地域、不同文明、不同发展阶段，超越意识形态分歧和社会制度差异，推动各国共享机遇、共谋发展、共同繁荣，成为构建人类命运共同体的生动实践。10年来，共建\u201c一带一路\u201d取得显著成效，开辟了世界经济增长的新空间，搭建了国际贸易和投资的新平台，提升了有关国家的发展能力和民生福祉，为完善全球治理体系拓展了新实践，为变乱交织的世界带来更多确定性和稳定性。<\/span>"],"field_name":["题干","答案"],"cardid":76012,"card_type":1,"dayid":null,"studytimestamp":1702013009}]
     * user_detail : {"favorite":[0,0,0,0,0,0,0,0,0,0,0,0],"have_note":[0,0,0,0,0,0,0,0,0,0,0,0],"study_status":[0,0,0,0,0,0,0,0,0,0,0,0],"user_choice":["","","","","","","","","","","",""],"finish_status":0,"isright":[-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1,-1],"note_content":["","","","","","","","","","","",""]}
     * card_groupid : 7601
     * last_learn : x4第1套主观题
     */

    private int errcode;
    private int card_groupid;
    private String last_learn;
    private List<LearnCardlistBean> learn_cardlist;

    public int getErrcode() {
        return errcode;
    }

    public void setErrcode(int errcode) {
        this.errcode = errcode;
    }

    public int getCard_groupid() {
        return card_groupid;
    }

    public void setCard_groupid(int card_groupid) {
        this.card_groupid = card_groupid;
    }

    public String getLast_learn() {
        return last_learn;
    }

    public void setLast_learn(String last_learn) {
        this.last_learn = last_learn;
    }

    public List<LearnCardlistBean> getLearn_cardlist() {
        return learn_cardlist;
    }

    public void setLearn_cardlist(List<LearnCardlistBean> learn_cardlist) {
        this.learn_cardlist = learn_cardlist;
    }

    public static class LearnCardlistBean implements Serializable {
        /**
         * content : ["34.(1)从感性认识与理性认识的辩证统一关系角度，说明如何处理好\u201c调查\u201d和\u201c研究\u201c两个环节的关系。","<span style=\"font-size:17px;font-family:Kaiti;color:#000000;font-weight:bold;\">(1)\u201c调查\u201d是指获取感性认识。\u201c研究\u201d是指在实践基础上认识活动由感性认识能动地飞跃到理性认识。感性认识是人们在实践基础上，由感觉器官直接感受到的关于事物的现象、事物的外部联系、事物的各个方面的认识。理性认识是指人们借助抽象思维，在概括整理大量感性材料的基础上，达到关于事物的本质、全体、内部联系和事物自身规律性的认识。<br>感性认识和理性认识的关系是辩证统一的。第一，理性认识依赖于感性认识。感性认识是认识过程的起点，是达到理性认识的必经阶段，没有感性认识，就没有理性认识。第二，感性认识有待于发展和深化为理性认识。感性认识是认识的初级阶段，是对事物外部联系的认识，还不能达到对事物的本质和规律的认识，因而还不是完全的认识。<br>从感性认识上升到理性认识，必须具备两个基本条件：第一，投身实践，深入调查，获取十分丰富和合乎实际的感性材料。这是实现由感性认识上升到理性认识的基础。第二，经过思考的作用，运用理论思维和科学抽象，将丰富的感性材料加以去粗取精、去伪存真、由此及彼、由表及里的处理加工，形成概念和理论的系统。<br>要想获得解决问题的正确认识，\u201c调查\u201d和\u201c研究\u201d缺一不可。如果割裂了二者的辩证统一关系，就会犯教条主义或经验主义的错误。<\/span>"]
         * field_name : ["题干","答案"]
         * cardid : 76001
         * card_type : 1
         * dayid : null
         * studytimestamp : 1702013009
         */

        private int cardid;
        private int card_type;
        private Object dayid;
        private int studytimestamp;
        private List<String> content;
        private List<String> field_name;

        public int getCardid() {
            return cardid;
        }

        public void setCardid(int cardid) {
            this.cardid = cardid;
        }

        public int getCard_type() {
            return card_type;
        }

        public void setCard_type(int card_type) {
            this.card_type = card_type;
        }

        public Object getDayid() {
            return dayid;
        }

        public void setDayid(Object dayid) {
            this.dayid = dayid;
        }

        public int getStudytimestamp() {
            return studytimestamp;
        }

        public void setStudytimestamp(int studytimestamp) {
            this.studytimestamp = studytimestamp;
        }

        public List<String> getContent() {
            return content;
        }

        public void setContent(List<String> content) {
            this.content = content;
        }

        public List<String> getField_name() {
            return field_name;
        }

        public void setField_name(List<String> field_name) {
            this.field_name = field_name;
        }
    }
}
